Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: That is, C<$::sail> is equivalent to C<$main::sail> (as well as to C<$main'sail>, still seen in ancient code, mostly from Perl 4).
es_es: Es decir, C<$::sail> es equivalente a C<$main::sail> (y también a C<$main'sail>, algo que se puede ver en código muy antiguo, escrito en su mayoría en Perl 4).

source: Do not modify the values of this hash, as they are the actual values stored in the optree.
es_es: No modifique los valores de este hash, ya que son los valores reales almacenados en el árbol de operaciones internas.

source: You may apply bug fixes, portability fixes and other modifications derived from the Public Domain or from the Copyright Holder.
es_es: Usted puede solicitar correcciones de errores, de portabilidad y otras modificaciones derivadas del Dominio Público o del Titular del Copyright.

source: i Do case-insensitive pattern matching.
es_es: i Hace coincidencia de patrones independiente del tamaño de caja.

source: When naming your module, consider the following:
es_es: Al escribir el nombre del módulo, considere lo siguiente:

source: On a successful match, the C<$REGERROR> variable will be set to FALSE, and the C<$REGMARK> variable will be set to the name of the last C<(*MARK:NAME)> pattern executed.
es_es: En una coincidencia exitosa, la variable C<$REGERROR> se establecerá a FALSE, y la variable C<$REGMARK> se establecerá al nombre del último patrón C<(*MARK:NOMBRE)> ejecutado.

source: Previously, it needed to be specified explicitly.
es_es: Anteriormente, era necesario que se especificara de forma explícita.

source: It calls any defined C<END> routines first, but these C<END> routines may not themselves abort the exit.
es_es: exit() llama primero a cualquier rutina definida C<END>, pero estas rutinas C<END> pueden abortar la salida por sí mismas.

source: If LIST is omitted, prints C<$_> to the currently selected output handle.
es_es: Si la LISTA se omite, se imprime C<$_> al actual canal de salida seleccionado.

source: You might have expected test 3 to fail because it seems to a more general purpose version of test 1.
es_es: Estará esperando a que el test 3 fallara, ya que parece una versión más general del test 1.

source: most significant digit first, with as few digits as possible.
es_es: primero el dígito más significativo, con el menor número posible de dígitos.

source: ($a, $b, undef, $c) = &foo; # Ignore third value returned
es_es: ($a, $b, undef, $c) = &foo; # Ignora tercer valor devuelto

source: The most common Perl platforms (Unix and Unix-like, Microsoft platforms, and VMS) have large enough testing and expert population that they are doing well.
es_es: Las plataformas más comunes de Perl (Unix y familia, las plataformas Microsoft y VMS) tiene pruebas lo suficientemente grandes y una población de expertos que lo están haciendo bien.

source: This is the internal function implementing the C<\l> escape in double-quoted strings.
es_es: Esta es la función interna que implementa el escapado C<\l> en las cadenas entre comillas dobles.

source: lexical scoping
es_es: ámbito léxico

source: and look for AUTOCONF or MPEAUTOCONF near the bottom
es_es: y mire por AUTOCONF o MPEAUTOCONF cerca del final

source: =head2 Relational Operators X<relational operator> X<operator, relational>
es_es: =head2 Operadores relacionales X<relational operator> X<operator, relational> X<operador relacional> X<operador, relacional>

source: nonassoc ++ --
es_es: no asoc. ++ --

source: In other words:
es_es: En otras palabras:

source: Wikiquote has the witticisms from Larry along with their source, including his usenet postings and source code comments.
es_es: En Wikiquote están registradas las citas ingeniosas de Larry, junto con su fuente. Se incluyen mensajes de usenet y comentarios de códigos fuente.

source: If no EXPR is given, returns an empty list in list context, the undefined value in scalar context, and (of course) nothing at all in void context.
es_es: Si no se indica EXPR, devuelve una lista vacía en contexto de lista, el valor indefinido en el contexto escalar, y (por supuesto) nada en absoluto en el contexto vacío.

source: Similarly, C<chomp $a, $b> is interpreted as C<chomp($a), $b> rather than as C<chomp($a, $b)>.
es_es: Similarmente, C<chomp $a, $b> es interpretado como C<chomp($a), $b> en vez de un C<chomp($a, $b)>.

source: In addition, Perl permits the following widely-supported conversions:
es_es: Además, Perl permite las siguientes conversiones ampliamente soportadas:

source: The only change I've made, that affects BONE systems is the recognition of whether it is a BONE system or not in C<hints/beos.sh>.
es_es: El único cambio que he hecho, que afecta a los sistemas BONE es el reconocimiento de si se trata de un sistema BONE o no, en C<hints/beos.sh>.

source: roll-your-own magic variables (including multiple simultaneous DBM implementations)
es_es: permite al usuario crear sus propias "variables mágicas" (incluidas varias implementaciones simultáneas de DBM)

source: Just because you I<CAN> do something a particular way doesn't mean that you I<SHOULD> do it that way.
es_es: Sólo porque usted I<PUEDA> hacer algo de una determinada manera no significa que usted I<DEBA> hacerlo de esa manera.

source: So, C<"\Q\t\E"> is converted to C<quotemeta("\t")>, which is the same as C<"\\\t"> (since TAB is not alphanumeric).
es_es: Así, C<"\Q\t\E"> es convertido a C<quotemeta("\t")>, que es lo mismo que C<"\\\t"> (porque TAB no es alfanumérico).

source: Also note that anything inside a C<\Q...\E> stays unaffected by C</x>.
es_es: También tenga en cuenta que cualquier cosa dentro de un C<\Q...\E> queda afectado por el C</x> .

source: printf "%vd", "AB\x{100}"; # prints "65.66.256"
es_es: printf "%vd", "AB\x{100}"; # imprime "65.66.256"

source: perldgux Perl notes for DG/UX
es_es: perldgux Notas para DG/UX

source: Your primary audience is a reasonably experienced developer with at least a moderate understanding of your module's application domain, who's just downloaded your module and wants to start using it as quickly as possible.
es_es: Su público principal es un desarrollador bastante experimentado con al menos un conocimiento moderado del dominio de aplicación de su módulo, que acaba de descargar su módulo y quiere empezar a utilizarlo tan pronto como sea posible.

source: State variables are similar to C<my> variables, but are declared with the C<state> keyword in place of C<my>.
es_es: Las variables C<state> son similares a las variables C<my>, pero son declaradas con la palabra clave C<state> en lugar de C<my>.

source: These special patterns are generally of the form C<(*VERB:ARG)>.
es_es: Estos patrones especiales son, generalmente, de la forma C<(*VERBO:ARG)>.

source: Described in L<perlobj>, L<perlboot>, L<perltoot>, L<perltooc>, and L<perlbot>.
es_es: Se describe en L<perlobj>, L<perlboot>, L<perltoot>, L<perltooc> y L<perlbot>.

source: left | ^
es_es: izquierda | ^

source: matches a chunk of non-parentheses, possibly included in parentheses themselves.
es_es: coincide con un trozo de no-paréntesis, posiblemente ellos mismos incluidos entre paréntesis.

source: See L<perlsub> for other scoping issues.
es_es: Ver L<perlsub> para otras cuestiones sobre el ámbito o contexto.

source: by David N. Blank-Edelman
es_es: David N. Blank-Edelman

source: add Devel::PPPort
es_es: añadido Devel::PPPort

source: The C</g> modifier specifies global pattern matching--that is, matching as many times as possible within the string.
es_es: El modificador C</g> especifica concordancia global del patrón - es decir, coincidencia tantas veces como sea posible dentro de la cadena.

source: Please see its README file in L<http://perl5.git.perl.org/metaconfig.git/> for more details.
es_es: Consulte el archivo README (en L<http://perl5.git.perl.org/metaconfig.git/>) para obtener información detallada.

# 'aaabaaab' =~ /a+b?(*COMMIT)(?{print "$& "; $count++})(*FAIL)/;
source: 'aaabaaab' =~ /a+b?(*COMMIT)(?{print "$&\n"; $count++})(*FAIL)/;
es_es: 'aaabaaab' =~ /a+b?(*COMMIT)(?{print "$&\n"; $contador++})(*FAIL)/;

source: C<PerlIO::via> iterate over layers properly now
es_es: C<PerlIO::via> ahora itera bien sobre las capas

source: use constant FOO => "something";
es_es: use constant FOO => "algo";

source: =item Single Quotes
es_es: =item Comillas simples

source: You may not charge a fee for this Package itself.
es_es: Usted no puede cobrar una cuota por el Paquete mismo.

source: Note that you have to be careful not to include the pattern delimiter in the comment--perl has no way of knowing you did not intend to close the pattern early.
es_es: Tenga en cuenta que hay que tener cuidado de no incluir el delimitador de patrón en el comentario: perl no tiene manera de saber que no tiene intención de cerrar el patrón tan pronto.

source: The C<code> is evaluated at run time, at the moment this subexpression may match.
es_es: El C<código> es evaluado en tiempo de ejecución, en el momento en que esta subexpresión puede coincidir.

source: C<Getopt::Long> upgraded to version 2.35
es_es: C<Getopt::Long> actualizado a la versión 2.35

source: perl.org?
es_es: ¿Y perl.org?

source: if (-x $file && (($d) = stat(_)) && $d < 0) {
es_es: if (-x $archivo && (($d) = stat(_)) && $d < 0) {

source: To get a true read(2) system call, see C<sysread>.
es_es: Para obtener una auténtica llamada del sistema read(2), ver C<sysread>.

source: C<Compress::Zlib> is an interface to the zlib compression library.
es_es: C<Compress::Zlib> es un interfaz a la biblioteca de compresión zlib.

source: Simple examples to open a file for reading:
es_es: Ejemplos sencillos para abrir un archivo en modo lectura:

source: It had been reported that running under perl's debugger when processing Unicode data could cause unexpectedly large slowdowns.
es_es: Se ha informado de que ejecutando el depurador de Perl cuando se tratan datos Unicode, podría causar una ralentización inesperadamente grande.

source: The C<KELVIN SIGN>, for example matches the letters "k" and "K"; and C<LATIN SMALL LIGATURE FF> matches the sequence "ff", which, if you're not prepared, might make it look like a hexadecimal constant, presenting another potential security issue.
es_es: El C<KELVIN SIGN>, por ejemplo, coincide con las letras "k" y "K", y C<LATIN SMALL LIGATURE FF> coincide con la secuencia "ff", que, si no está preparado, puede hacer que se vea como una constante hexadecimal, presentando otro problema potencial de seguridad.

source: To disambiguate, use a space or change the order of the flags:
es_es: Para eliminar la ambigüedad, use un espacio o cambie el orden de las opciones:

source: If not, I'll be glad to provide one.
es_es: Si no, estaré encantado de darle una.

source: Arrays and slices are interpolated into double-quoted strings by joining the elements with the delimiter specified in the C<$"> variable (C<$LIST_SEPARATOR> if "use English;" is specified), space by default.
es_es: Arrays y porciones son interpoladas dentro de cadenas con dobles comillas, uniendo los elementos con el delimitador especificado en la variable <C$"> (C<$LIST_SEPARATOR> si se especifica "use English;"), siendo el espacio en blanco el valor por defecto.

source: The ordinal value of a character is called a B<code point>.
es_es: El valor ordinal de un carácter se denomina B<código de carácter> (I<code point>)

source: X</> X<slash>
es_es: X</> X<slash> X<barra diagonal>

source: A powerful tool for optimizing such beasts is what is known as an "independent group", which does not backtrack (see L</C<< (?>pattern) >>>).
es_es: Una poderosa herramienta para la optimización de estas bestias es lo que se conoce como un "grupo independiente", que no hace marcha atrás (vea L</C<< (?>patrón) >>>).

source: When perl is configured to use ithreads, it will use re-entrant library calls in preference to non-re-entrant versions.
es_es: Cuando Perl está configurado para usar ithreads, usará llamadas de biblioteca reentrantes preferentemente sobre versiones no-reentrantes.

source: Note that the smart match implicitly dereferences any non-blessed hash or array ref, so the "Hash" and "Array" entries apply in those cases.
es_es: Note que la coincidencia inteligente, implícitamente, desreferencia cualquier referencia hash o array no bendecida, así que las entradas "Hash" y "Array" se aplican en estos casos.

source: DIRHANDLEs have their own namespace separate from FILEHANDLEs.
es_es: Los IDENTIFICADOR_DIR tienen su propio espacio de nombres separados de los IDENTIFICADORes de archivo.

source: See also L<perlipc/"SysV IPC">, C<IPC::SysV>, C<IPC::SysV::Semaphore> documentation.
es_es: Vea también la documentación de L<perlipc/"SysV IPC">, C<IPC::SysV>, y C<IPC::Semaphore>.

source: For reasons of security, this construct is forbidden if the regular expression involves run-time interpolation of variables, unless the perilous C<use re 'eval'> pragma has been used (see L<re>), or the variables contain results of the C<qr//> operator (see L<perlop/"qr/STRINGE<sol>msixpodual">).
es_es: Por razones de seguridad, esta construcción está prohibida si la expresión regular incluye interpolación de variables en tiempo de ejecución, a menos que el peligroso pragma C<use re 'eval'> esté en uso (vea L<re>), o las variables contengan resultados del operador C<qr//> (vea L<perlop/"qr/CADENAE<sol>msixpodual">).

source: The iterator is implicitly reset when C<each> has reached the end as just described; it can be explicitly reset by calling C<keys> or C<values> on the hash or array.
es_es: El iterador es implícitamente restablecido cuando C<each> ha llegado al final como se acaba de describir; puede ser explícitamente restablecido llamando a C<keys> o C<values> sobre el hash o array.

source: you have to write
es_es: tiene que escribir

source: =head1 Modules and Pragmata
es_es: =head1 Módulos y Pragmata

source: This command-line utility, used to print or to check SHA digests, comes with the new C<Digest::SHA> module.
es_es: Esta utilidad de línea de comandos, se utiliza para imprimir o comprobar resúmenes SHA; viene con el nuevo módulo C<Digest::SHA>.

source: use Module ();
es_es: use Módulo ();

source: A continue block is often used to reset line counters or C<m?pat?> one-time matches:
es_es: Un bloque C<continue> se usa a menudo para reiniciar contadores de línea o patrones C<m?patrón?> de un sólo uso:

source: Note that a return value of C<-1> could mean that child processes are being automatically reaped, as described in L<perlipc>.
es_es: Tenga en cuenta que un valor devuelto de C<-1> podría significar que los procesos hijos se están automáticamente desechando, como se describe en L<perlipc>.

source: B<Encoding> (as a verb) is the conversion from I<text> to I<binary>.
es_es: B<Codificar> consiste en convertir I<texto> a I<binario>.

source: Here's an example to test whether Nagle's algorithm is enabled on a socket:
es_es: Aquí hay un ejemplo para comprobar si el algoritmo de Nagle está habilitado en un I<socket>:

source: You don't have to check for C<defined> on the return from C<fcntl>.
es_es: No necesita comprobar con C<defined> al regreso de C<fcntl>.

source: A patch for FreeBSD libc is available (see http://www.freebsd.org/cgi/query-pr.cgi?pr=misc/30631 ) which has been integrated into FreeBSD 4.6.
es_es: Un parche para la libc de FreeBSD está disponible (ver http://www.freebsd.org/cgi/query-pr.cgi?pr=misc/30631 ) y ha sido integrado en FreeBSD 4.6.

source: m{ (?: NON_ZERO_LENGTH | ZERO_LENGTH )* }x;
es_es: m{ (?: NO_CERO_LONGITUD | CERO_LONGITUD )* }x;

source: Perl was made to be a glue language, and one of the things it glues together is commands.
es_es: Perl fue creado para ser un lenguaje pegamento, y una de las cosas que aglutina, son los comandos.

source: =item say FILEHANDLE
es_es: =item say IDENTIFICADOR_ARCHIVO

source: ISBN 978-0-596-52069-4 [May 2009]
es_es: ISBN 978-0-596-52069-4 [Mayo de 2009]

source: A C<split> with no arguments really does a S<C<split(' ', $_)>> internally.
es_es: Un C<split> sin argumentos realmente es internamente un S<C<split(' ', $_)>>.

source: but is more efficient.
es_es: pero es más eficiente.

# print "Exists " if exists &subroutine;
source: print "Exists\n" if exists &subroutine;
es_es: print "Existe\n" if exists &subrutina;

source: Documentation typo fixed
es_es: Arreglado un error ortográfico en la documentación

source: If FILENAME is omitted, does a C<chroot> to C<$_>.
es_es: Si ARCHIVO se omite, hace un C<chroot> a C<$_>.

source: A new feature called I<assertions> will be available.
es_es: Una nueva característica llamada I<assertions> estará disponible.

source: perlos400 has been added to tell about the installation and use of Perl in OS/400 PASE.
es_es: perlos400 ha sido añadido para hablar acerca de la instalación y el uso de Perl en OS/400 PASE.

source: =head2 I/O flow (the actual 5 minute tutorial)
es_es: =head2 Flujo de E/S (el auténtico tutorial, en 5 minutos)

source: Efficient but dangerous.
es_es: Eficiente pero peligroso.

source: The extra switch disables the execution of AutoRun commands from the registry, which is generally considered undesirable when running external programs.
es_es: Esta opción adicional deshabilita la ejecución de los comandos AutoRun del registro, que generalmente se considera indeseable cuando se ejecutan programas externos.

source: If any
es_es: Si los

source: probably doesn't do what you expect at first glance.
es_es: probablemente no hace lo que usted espera, a primera vista.

source: =head1 Utility Changes
es_es: =head1 Cambios en las herramientas

source: Note the I<in bytes>: even if the filehandle has been set to operate on characters (for example by using the C<:encoding(utf8)> open layer), tell() will return byte offsets, not character offsets (because implementing that would render seek() and tell() rather slow).
es_es: Nota sobre lo de I<en bytes>: incluso si el identificador de archivo se ha puesto para operar en caracteres (por ejemplo usando la capa de open C<:encoding(utf8)>), tell() devolverá desplazamientos en bytes, no en caracteres (porque implementando esto convertirían en lentas a seek() y tell()).

source: In particular, the lower bound is not optional.) The "*" quantifier is equivalent to C<{0,}>, the "+" quantifier to C<{1,}>, and the "?" quantifier to C<{0,1}>.
es_es: En particular, el límite inferior no es opcional). El cuantificador "*" es equivalente a C<{0,}>, el cuantificador "+" a C<{1,}>, y el cuantificador "?" a C<{0,1}>.

source: C<unless> can even be followed by one or more C<elsif> statements, though you may want to think twice before using that particular language construct, as everyone reading your code will have to think at least twice before they can understand what's going on.
es_es: C<unless> puede, incluso, ser seguido por una o más instrucciones C<elsif>, aunque quizás quiera pensarlo dos veces antes de usar esta construcción del lenguaje tan particular, lo mismo que cualquiera que al leer su código tendrá que pensar al menos dos veces antes de entender qué ha querido decir.

source: The layout of directories in F<ext> has been revised.
es_es: La disposición de los directorios en F<ext> ha sido revisada.

source: print sqrt(-4); # prints 2i
es_es: print sqrt(-4); # imprime 2i

source: # same thing with Unicode circled letters.
es_es: # lo mismo con letras Unicode acentuadas.

source: Others are experimental and may change without warning or be completely removed.
es_es: Otros son experimentales y pueden cambiar sin previo aviso o ser retirados por completo.

source: If your destructors (the DESTROY subroutines) have assumed any particular ordering to the global destruction, there might be problems ahead.
es_es: Si sus destructores (las subrutinas DESTROY) han asumido cualquier tipo de orden para la destrucción global, podrían ocurrir problemas más adelante.

# $baz = " "; # a one-character string
source: $baz = "\n"; # a one-character string
es_es: $baz = "\n"; # una cadena de un carácter

source: Unlike in B<csh>, no translation is done on the return data--newlines remain newlines.
es_es: A diferencia de B<csh>, no se realiza traducción en el retorno de los datos: los caracteres de fin de línea siguen siendo caracteres de fin de línea.

source: Practical hint: you almost never need to use C<eof> in Perl, because the input operators typically return C<undef> when they run out of data or encounter an error.
es_es: Truco práctico: casi nunca necesita usar C<eof> en Perl, porque los operadores de entrada normalmente devuelven C<undef> cuando no hay más datos, o si se produce un error.

source: perlpragma Perl modules: writing a user pragma
es_es: perlpragma Programación de un pragma de usuario

# print "Count=$count ";
source: print "Count=$count\n";
es_es: print "Contador=$contador\n";

source: There's more than one reason you're encouraged to restrict your delimiters to non-alphanumeric, non-whitespace choices.
es_es: Hay más motivos que nos alientan para restringir sus delimitadores a elecciones no alfanuméricas ni espacios en blanco.

source: Here are some more examples; be aware that when using an explicit index, the C<$> may need escaping:
es_es: Éstos son algunos ejemplos más; sea consciente de que cuando se utiliza un índice explícito, el C<$> puede ser necesario escaparlo:

source: =head2 To OO or not to OO?
es_es: =head2 ¿POO o no POO?

source: See also L<perlguts/"Magic Variables">.
es_es: Vea también L<perlguts/"Variables Mágicas">.

source: C<(?R)> recurses to the beginning of the whole pattern.
es_es: C<(?R)> re-ejecuta hasta el comienzo de todo el patrón.

source: Now that "script" and "scripting" are terms that have been seized by unscrupulous or unknowing marketeers for their own nefarious purposes, they have begun to take on strange and often pejorative meanings, like "non serious" or "not real programming".
es_es: Ahora que mercaderes sin escrúpulos ni conocimientos se han apropiado de los términos "script" y "scripting" para sus viles propósitos, se les ha empezado a asociar significados extraños, generalmente peyorativos, como "programación poco seria" o "programación menor".

source: For Windows, Vanilla Perl ( http://vanillaperl.com/ ) and Strawberry Perl ( http://strawberryperl.com/ ) come with a bundled C compiler.
es_es: Para Windows, Vanilla Perl ( http://vanillaperl.com/ ) y Strawberry Perl ( http://strawberryperl.com/ ) incorporan un compilador de C.

source: 4 uid numeric user ID of file's owner
es_es: 4 uid ID numérico del usuario propietario del archivo

source: As with filehandle reads, an automatic C<defined> is generated when the glob occurs in the test part of a C<while>, because legal glob returns (e.g. a file called F<0>) would otherwise terminate the loop.
es_es: Al igual que cuando un identificador de archivo lee, un C<defined> es generado cuando la expansión se produce en la parte de prueba de un C<while>, porque una expansión legal así lo devuelve (por ejemplo, un archivo llamado F<0>); de otra manera terminaría el bucle.

source: } @old;
es_es: } @viejo;

source: # foo eq "ABCD"
es_es: # foo es "ABCD"

source: Some words in English work this way, like "fish" and "sheep".
es_es: Existen algunas palabras en Español que funcionan de esa manera, como "crisis", "ciempiés" o "lunes", que actúan de singular o plural dependiendo del contexto.

source: The Boolean context is just a special kind of scalar context where no conversion to a string or a number is ever performed.
es_es: El contexto booleano es simplemente un tipo especial de contexto escalar para el cual ni siquiera se llega a realizar ninguna conversión a cadena o a número.

source: Options can now take multiple values at once (experimental)
es_es: Las opciones ahora pueden tomar múltiples valores al mismo tiempo (experimental)
